nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/driver_examples/xspi/octal/edma_transfer/cm33_core0/pin_mux.c
    IOPCTL_PinMuxSet(6U, 11U, port6_pin11_config);

    const uint32_t port6_pin12_config = (
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_DRIVE_100OHM |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);

    IOPCTL_PinMuxSet(6U, 12U, port6_pin12_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
